cask_args appdir: '/Applications'

def macos?
  RbConfig::CONFIG['host_os'].include?('darwin')
end

def minimal?
  is_minimal = ENV.fetch('BREW_MINIMUM', 'false')
  !(is_minimal == 'true' || is_minimal == 'yes' || is_minimal = '1')
end

# General tools
brew 'zsh'
brew 'git'
brew 'git-flow-avh'
brew 'tig'
brew 'mosh'
brew 'btop'
brew 'helix'
brew 'gnupg'
brew 'zoxide'
brew 'exa'
# brew 'broot'
brew 'fzf'
brew 'watch'
brew 'wget'
brew 'ssh-copy-id'
brew 'bat'
brew 'neofetch'
brew 'tree'
brew 'tmux'

if minimal?
  # 第三方库
  tap 'kopia/kopia'

  # Development tools
  brew 'asdf'
  brew 'axel'
  brew 'httpie'
  brew 'mitmproxy'
  brew 'mtr'

  brew 'yt-dlp'
  brew 'kopia'

  # Blogging
  brew 'hugo'

  # Tmux
  brew 'reattach-to-user-namespace'

  # DevOps
  brew 'ansible'
  brew 'terraform'
  brew 'kubernetes-cli'
end

if macos?
  tap 'homebrew/cask-drivers'
  tap 'jandedobbeleer/oh-my-posh'

  # zsh themes
  brew 'oh-my-posh'

  # Development Tools
  brew 'terminal-notifier'
  brew 'postgresql@16'
  brew 'imagemagick'

  # Tweaks
  brew 'pinentry-mac'
  brew 'mas'

  # macOS Apps
  # cask 'alfred'
  cask 'raycast'
  cask 'google-chrome'
  cask 'iterm2'
  cask 'the-unarchiver'
  cask 'hiddenbar'
  # cask 'jordanbaird-ice' # requires sonama
  cask 'visual-studio-code'
  cask 'karabiner-elements'
  cask 'appcleaner'
  cask 'notion'
  cask 'baiduinput'
  cask 'iina'
  # cask 'android-studio'
  cask 'synology-drive'

  # macOS QuickLook Extensions
  cask 'provisionql'
  cask 'qlcolorcode'
  cask 'quicklook-json'

  # macOS non-ascii fonts for terminal
  cask 'font-meslo-lg-nerd-font'
end
