cask_args appdir: '/Applications'

def macos?
  RbConfig::CONFIG['host_os'].include?('darwin')
end

# 第三方库
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "kopia/kopia"

# Git
brew 'git'
brew 'git-flow-avh'
brew 'tig'

# Development tools
brew 'asdf'
brew 'axel'
brew 'httpie'
brew 'mosh'
brew 'mitmproxy'
brew 'htop'
brew 'mkcert'

# Gnupg
brew 'gnupg'

# Tweaks
brew 'zsh'
brew 'zoxide'
brew 'exa'
# brew 'broot'
brew 'fzf'
brew 'mtr'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'ssh-copy-id'
brew 'youtube-dl'
brew 'bat'
brew 'neofetch'
brew 'terminal-notifier'
brew 'kopia'


# Blogging
brew 'hugo'

# Tmux
brew 'tmux'
brew 'reattach-to-user-namespace'

# DevOps
brew 'ansible'

if macos?
  # Development Tools
  brew 'postgresql'
  brew 'redis'
  # brew 'node'
  brew 'imagemagick'

  # Tweaks
  brew 'pinentry-mac'
  brew 'mas'

  # macOS Apps
  cask 'alfred'
  cask 'google-chrome'
  cask 'iterm2'
  cask 'the-unarchiver'
  cask 'dozer'
  cask 'visual-studio-code'
  cask 'clashx'
  cask 'karabiner-elements'
  cask 'appcleaner'
  cask 'notion'
  cask 'baiduinput'
  cask 'iina'
  # cask 'android-studio'
  cask 'synology-drive'

  # macOS QuickLook Extensions
  cask 'provisionql'
  cask 'qlcolorcode'
  cask 'quicklook-json'

  # macOS non-ascii fonts for terminal
  cask 'font-meslo-lg-nerd-font'
end
