cask_args appdir: '/Applications'

# Taps
tap 'homebrew/services'
tap 'homebrew/cask-fonts'

# Git
brew 'git'
brew 'git-flow-avh'
brew 'tig'

# Development Tools
brew 'postgresql'
brew 'redis'
brew 'node'
brew 'imagemagick'

# Development Language
brew 'crystal'

# Development tools
brew 'axel'
brew 'httpie'
brew 'mosh'
brew 'mitmproxy'
brew 'htop'
brew 'mkcert'

# Tweaks
brew 'zsh'
brew 'fasd'
brew 'fzf'
brew 'mtr'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'ssh-copy-id'
brew 'youtube-dl'
brew 'bat'
brew 'neofetch'
brew 'terminal-notifier'


# Blogging
brew 'hugo'

# Tmux
brew 'tmux'
brew 'reattach-to-user-namespace'

# DevOps
brew 'ansible'

# macOS Apps
cask 'alfred'
cask 'dozer'
cask 'visual-studio-code'
cask 'google-chrome'
cask 'iterm2'
cask 'the-unarchiver'
cask 'karabiner-elements'
cask 'appcleaner'
cask 'notion'
cask 'baiduinput'
cask 'iina'
cask 'clashx'

# Android Studio
cask 'android-studio'

# macOS QuickLook Extensions
cask 'provisionql'
cask 'qlcolorcode'
cask 'quicklook-json'

# macOS non-ascii fonts for terminal
cask 'font-droid-sans-mono-for-powerline'
cask 'font-roboto'
